README.org
#+TITLE:      purescript-is-fun
#+OPTIONS:    ^:{}
#+REPOSITORY: https://github.com/luckynum7/purescript-is-fun

* Development

** Preparation

   1. nodejs
   2. purescript

*** Installing the Compiler

1.Install from package manager

#+BEGIN_SRC bash
pacman -S purescript
#+END_SRC

2.To install ~purescript~ from ~npm~, you may need to install ~haskell-stack~ package first

[[https://docs.haskellstack.org/en/stable/install_and_upgrade/]]

#+BEGIN_SRC bash
apt-get install haskell-stack
# or
pacman -S haskell-stack
#+END_SRC

then

#+BEGIN_SRC bash
npm install -g purescript
#+END_SRC

*** Setting up the Development Environment

#+BEGIN_SRC bash
npm install -g pulp bower
#+END_SRC

*** Create project

#+BEGIN_SRC bash
pulp init
#+END_SRC

*** Working in ~PSCi~

#+BEGIN_SRC bash
pulp psci
#+END_SRC

** Troubleshooting

*** Missing ~libtinfo.so.5~

Install ~ncurses5-compat-libs~ from [[https://aur.archlinux.org/packages/ncurses5-compat-libs/][AUR]]

* References

  1. [[http://www.purescript.org/]]
  2. [[https://leanpub.com/purescript][/PureScript by Example/]] by Phil Freeman
     1) [[https://github.com/purescript]]
     2) [[https://github.com/purescript-node]]
     3) [[https://github.com/purescript-contrib]]
  3. [[https://github.com/passy/awesome-purescript][awesome-purescript]]
  4. [[https://github.com/trending/purescript]]

** Bundle (Preludes)

   1. [[https://github.com/tfausak/purescript-batteries][purescript-batteries]]: :battery: A PureScript prelude with more features.
   2. [[https://github.com/purescript-contrib/purescript-base]]

** UI Libraries

   1. [[https://github.com/alexmingoia/purescript-pux][purescript-pux]]: A PureScript interface to React. [[https://www.purescript-pux.org/]]
      1) [[https://www.youtube.com/watch?v=MvAiOTJNLNQ][Michael Trotter - PureScript & Pux -- a safer, more expressive way to React]]
         - Slides: [[http://purescript-react-rally.surge.sh/]]
         - Source: [[https://github.com/spicydonuts/purescript-spectacle-presentation]]

** PureScript + X

   1. [[https://github.com/rgrempel/purescript-elm]] (Elm)
      1) [[https://www.youtube.com/watch?v=O_kWwaghZ9U][Elm in Purescript]]
